# while True:     
#     try:
#         x = int(input('กรุณาใส่เลขจำนวนเต็ม >>>'))
#         break
#     except:
#         print('ท่านใส่ข้อมูลไม่ถูกต้อง \n')
#         continue #ไม่ระบุคำสั่งนี้ก็ได้
# print('ขอบคุณครับ') 

def get_int():
    try:
        x =int(input('กรุณาใส่เลขจำนวนเต็ม>>>>'))
        return x 
    except:
        print ('ท่านใส่ข้อมูลไม่ถูกต้อง\n')
        get_int() #ถ้าเกิดข้อผิดพลาด ให้เรียกใช้ฟังชั่นที่เป็นตัวมันเองขึ้นมาทำงานซำ้อีก
        
#--------------------------------------------------------------------------------
x = get_int()
# print('ขอบคุณครับ')